// #############################################################################################################################
// DEFINE
// 
// 为二进制编码重命名，增加可读性
// #############################################################################################################################

`define     FALSE               1'b0
`define     TRUE                1'b1

// SIGNAL
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

// MAIN Memory
// -------------------------------------------------------------------------
// task type
`define     READ                1'b0
`define     WRITE               1'b1

// working status
`define     MEM_RESTING         2'b00
`define     MEM_WORKING         2'b01
`define     MEM_FINISHED        2'b10


// INSTRUCTION CACHE
// -------------------------------------------------------------------------
`define     ICACHE_NOP          2'b00
`define     ICACHE_WORKING      2'b01
`define     IF_FINISHED         2'b10
`define     ICACHE_RESTING      2'b11



// DATA CACHE
// -------------------------------------------------------------------------
`define     DCACHE_NOP          2'b00
`define     DCACHE_WORKING      2'b01
`define     R_W_FINISHED        2'b10
